import { Product_navbar } from "@/components/component/product_navbar";

/**
 * v0 by Vercel.
 * @see https://v0.dev/t/00iWWBq0jnD
 * Documentation: https://v0.dev/docs#integrating-generated-code-into-your-nextjs-app
 */
export default function Student_Terms() {
    return (
      <>
      <Product_navbar />
      <div className="container mx-auto max-w-4xl px-4 py-12">  
        <h1 className="mb-8 text-3xl font-bold">KisoCore 利用規約</h1>
        <p>最終更新日: 2024年7月1日</p>
        <br />
        <div className="space-y-8">
            <p>本利用規約（以下「本規約」といいます）は、KisoCore 運営チーム（以下「サービス運営チーム」といいます）が提供するオンライン学習管理システム（LMS,以下「本サービス」といいます）の利用に関する条件を定めるものです。本サービスを利用することにより、利用者は本規約に同意したものとみなされます。</p>
          <section>
            <div className="prose">
              <h1 className="text-3xl">第1条(利用登録)</h1>
              <br />
              <p>1.利用者は、本サービスを利用するために必要な情報を提供し、Googleアカウントを用いてアカウントを登録するものとします。登録情報には、氏名、メールアドレス、電話番号、その他の連絡先情報が含まれます。</p>
              <p>2.利用者は、提供する情報が正確かつ最新であることを保証し、情報に変更が生じた場合は速やかに更新するものとします。</p>
              <p>3.アカウントは個人専用とし、第三者と共有してはならないものとします。利用者はアカウントの不正使用を防止するため、アカウント管理を保持する責任を負うものとします。</p>
              <br />
              <h1 className="text-3xl">第2条(利用者の責任)</h1>
              <br />
              <p>1.利用者は、本サービスを利用する際に適用されるすべての法律および規制を遵守するものとします。</p>
              <p>2.利用者は、他の利用者または第三者の権利を侵害しないように本サービスを利用するものとします。これには、著作権、商標権、プライバシー権を含みますが、これに限りません。</p>
              <p>3.利用者は、本サービスを通じて得た情報を適切に取り扱い、無断で第三者に提供または公開しないものとします。</p>
              <br />
              <h1 className="text-3xl">第3条(禁止事項)</h1>
              <br />
              <p>1.本サービスの運営を妨げる行為。これには、サービスに過度な負荷をかける行為や、システムに不正アクセスする行為が含まれます。</p>
              <p>2.不正アクセスまたはそれを試みる行為。これには、他の利用者のアカウントにアクセスしようとする行為が含まれます。</p>
              <p>3.他の利用者の個人情報を不正に取得する行為。これには、フィッシングやその他の詐欺行為が含まれます。</p>
              <p>4.本サービスを通じて有害なコンテンツ（ウイルス、スパム、その他の悪意のあるプログラム）を配布する行為。</p>
              <p>5.その他、公序良俗に反する行為。これには、違法な活動を助長する行為や、暴力的、わいせつ的なコンテンツの配布が含まれます。</p>
              <br />
              <h1 className="text-3xl">第4条(知的財産権)</h1>
              <br />
              <p>1.本サービスおよび関連するコンテンツは、サービス運営チームまたはそのライセンサーの知的財産権に帰属します。これには、テキスト、画像、音声、動画、問題、解答解説、ソフトウェア、およびその他の素材が含まれます。</p>
              <p>2.利用者は、サービス運営チームの事前の書面による承諾なしに、本サービスのコンテンツを複製、改変、配布、公開、展示、翻訳、翻案、二次的著作物の作成などを行うことはできません。</p>
              <p>3.サービス運営チームは、本サービス内で提供される資料およびコンテンツの一部において、第三者が著作権を有する著作物を引用しています。これには、教育目的や情報提供のために使用される文献、画像、動画、その他のメディアが含まれます。サービス運営チームが引用する際には、適用される著作権法およびフェアユースの原則に従い、適切な引用形式を遵守しています。</p>
              <p>4.利用者が本サービスに投稿するコンテンツについては、利用者はサービス運営チームに対して非独占的、譲渡可能、サブライセンス可能、ロイヤルティフリーのライセンスを付与するものとします。また、利用者は、投稿するコンテンツが第三者の知的財産権を侵害していないことを保証するものとします。</p>
              <br />
              <h1 className="text-3xl">第5条(免責事項)</h1>
              <br />
              <p>1.当社は、本サービスの利用に起因するいかなる損害についても、一切の責任を負わないものとします。これには、データの損失、収益の損失、事業の中断が含まれますが、これに限りません。</p>
              <p>2.当社は、本サービスが常に利用可能であること、またはエラーがないことを保証するものではありません。本サービスは「現状のまま」で提供され、特定の目的への適合性、正確性、信頼性についての保証を行いません。</p>
              <p>3.当社は、利用者が本サービスを通じて取得した情報やコンテンツの正確性、信頼性、完全性について、一切の責任を負わないものとします。</p>
              <br />
              <h1 className="text-3xl">第6条(サービスの変更・中止)</h1>
              <br />
              <p>1.当社は、事前の通知なしに本サービスの内容を変更、停止または中止することができるものとします。これには、機能の追加、削除、変更が含まれます。</p>
              <p>2.当社は、サービスの変更、中止に伴ういかなる損害についても、一切の責任を負わないものとします。</p>
              <br />
              <h1 className="text-3xl">第7条(利用規約の変更)</h1>
              <br />
              <p>1.当社は、本規約を随時変更することができるものとします。変更後の規約は、本サービスに掲載された時点から効力を生じるものとします。</p>
              <p>2.利用者は、変更後の規約に同意しない場合、本サービスの利用を停止することができます。利用を継続することにより、変更後の規約に同意したものとみなされます。</p>
              <br />
              <h1 className="text-3xl">第8条(準拠法および管轄裁判所)</h1>
              <br />
              <p>本規約は、日本法に準拠し、日本法に従って解釈されるものとします。本規約に関する紛争は、函館地方裁判所を専属的な管轄裁判所とします。</p>
              <br />
              <h1 className="text-3xl">第9条(契約の終了)</h1>
              <br />
              <p>1.利用者は、いつでもアカウントを削除することにより、本サービスの利用を終了することができるものとします。</p>
              <p>2.当社は、利用者が本規約に違反した場合、事前の通知なしにアカウントを停止または削除する権利を有するものとします。</p>
              <p>3.アカウントの終了後も、本規約のうち性質上継続すべき条項は引き続き有効とするものとします。</p>
              <br />
              <h1 className="text-3xl">第10条(雑則)</h1>
              <br />
              <p>1.本規約のいずれかの条項が無効または執行不能と判断された場合でも、その他の条項は引き続き有効とします。</p>
              <p>2.本規約に関する問い合わせは、当社のカスタマーサポートまで行うものとします。</p>
            </div>
          </section>
        </div>
      </div>

      <div className="container mx-auto max-w-4xl px-4 py-12">  
        <h1 className="mb-8 text-3xl font-bold">KisoCore プライバリーポリシー</h1>
        <p>最終更新日: 2024年7月2日</p>
        <br />
        <div className="space-y-8">
            <p>サービス運営チームは、利用者の個人情報を保護することを重要と考えています。本プライバシーポリシー（以下「本ポリシー」といいます）は、当社が利用者の個人情報を収集、使用、共有、および保護する方法について説明するものです。本サービスを利用することにより、利用者は本ポリシーに同意したものとみなされます。</p>
          <section>
            <div className="prose">
              <h1 className="text-3xl">第1条(収集する情報)</h1>
              <br />
              <p>サービス運営チームは、本サービスを提供するために以下の個人情報を収集します。</p>
              <p>1.利用者の氏名、メールアドレス、電話番号、住所などの連絡先情報。</p>
              <p>2.Googleアカウントに関連する情報。</p>
              <p>3.利用者が本サービス内で提供する学習履歴、成績、フィードバックなどの学習関連情報。</p>
              <p>4.利用者が本サービスを利用する際に自動的に収集されるIPアドレス、クッキー、ブラウザの種類、アクセス日時、利用履歴などの技術情報。</p>
              <br />
              <h1 className="text-3xl">第2条(情報の利用目的)</h1>
              <br />
              <p>当社は、収集した個人情報を以下の目的で利用します。</p>
              <p>1.本サービスの提供、維持、改善。</p>
              <p>2.利用者の本人確認およびアカウント管理。</p>
              <p>3.利用者の学習進捗の管理およびサポート。</p>
              <p>4.利用者からの問い合わせ対応。</p>
              <p>5.利用者に対するお知らせ、更新情報、プロモーション情報の提供。</p>
              <p>6.サービスの利用状況分析およびマーケティング活動の最適化。</p>
              <br />
              <h1 className="text-3xl">第3条(情報の共有)</h1>
              <br />
              <p>当社は、以下の場合を除き、利用者の個人情報を第三者に開示しません。</p>
              <p>1.利用者の同意がある場合。</p>
              <p>2.法令に基づく場合。</p>
              <p>3.人の生命、身体、または財産の保護のために必要がある場合で、利用者の同意を得ることが困難である場合。</p>
              <p>4.公衆衛生の向上または児童の健全な育成推進のために特に必要がある場合で、利用者の同意を得ることが困難である場合。</p>
              <p>5.国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合で、利用者の同意を得ることにより当該事務の遂行に支障を及ぼす恐れがある場合。</p>
              <br />
              <h1 className="text-3xl">第4条(情報の安全管理)</h1>
              <br />
             <p>当社は、利用者の個人情報を不正アクセス、紛失、破壊、改ざん、漏洩などから保護するために、適切な技術的および組織的措置を講じます。</p>
              <br />
              <h1 className="text-3xl">第5条(個人情報の開示、訂正、削除)</h1>
              <br />
              <p>1.利用者は、当社に対して自己の個人情報の開示を請求することができます。開示の結果、誤った情報があった場合、利用者はその訂正または削除を請求することができます。</p>
              <p>2.個人情報の開示、訂正、削除を希望する場合は、当社のカスタマーサポートまでご連絡ください。</p>
              <br />
              <h1 className="text-3xl">第6条(プライバシーポリシーの変更)</h1>
              <br />
              <p>当社は、本ポリシーを随時変更することがあります。変更後のポリシーは、本サービスに掲載された時点から効力を生じるものとします。利用者は、変更後のポリシーに同意しない場合、本サービスの利用を停止することができます。</p>
              <br />
              <h1 className="text-3xl">第7条(お問い合わせ)</h1>
              <br />
              <p>本ポリシーに関するお問い合わせは、以下の連絡先までお願いいたします。</p>
              <br />
              <p>KisoCore 運営チーム</p>
              <p>Email: <a href="mailto:rentosugiki.0705+kisocore_support@gmail.com" className="text-blue-500">rentosugiki.0705+kisocore_support@gmail.com</a></p>
              <p>LINE公式アカウント サポート:<a className="text-blue-500" href="https://lin.ee/0MXsSRY">アカウントURL</a></p>
              <p>一般お問い合わせ:<a className="text-blue-500" href="/contact">ページへ移動</a></p>
              <p>運営チーム お問い合わせ:<a className="text-blue-500" href="/team/contact">ページへ移動</a></p>
            </div>
          </section>
        </div>
      </div>
      </>
    )
  }